import random

a = 3
b = 20
numbers = list(range(a, b+1))
print(numbers) # список от 3 до 20

number1 = random.choice(numbers)
print(number1) # вывод в первом поле случайного числа из списка numbers

numbers2 = ''
for i in range(1, number1):
    for j in range(i+1, number1):
        if number1 % (i + j) == 0:
            numbers2 = numbers2 + str(i) + str(j)
print(str(number1), ' - ', numbers2)

#print(number1, '-', number2, number3) #итоговый вывод задания, нужно как то вывести список результатов number 2 и number3


# подбор пары при сумму равной number1 (для примера значение 19 = (1 и 18, 2  и 17 и тд до 19 // 2(9) и 19 // 2 + 1(10)))
# подумать и исправить список пример(18 - 1 и 2 1 и 5 1 и 8 1 и 17 2 и 4 2 и 7 2 и 16 3 и 6 3 и 15 4 и 5 4 и 14 5 и 13 6 и 12 7 и 11 8 и 10) то есть сумма первого и 2 числа целочисленно делится на 18 затем по формуле выше
#print(number1 - number2 (*(список или словарь)))

#3 - 12
#4 - 13
#5 - 1423
#6 - 121524
#7 - 162534
#8 - 13172635
#9 - 1218273645
#10 - 141923283746
#11 - 11029384756
#12 - 12131511124210394857
#13 - 112211310495867
#14 - 1611325212343114105968
#15 - 1214114232133124115106978
#16 - 1317115262143531341251161079
#17 - 11621531441351261171089
#18 - 12151811724272163631545414513612711810
#19 - 118217316415514613712811910
#20 - 13141911923282183731746416515614713812911